/**
******************************************************************************
* @file
* @author  HQS 胡乔申
* @version V1.0.0
* @date    2018/02/26
* @brief   RTCHAL 时钟
******************************************************************************
* @brief
*
*
*
*/
/* Includes ------------------------------------------------------------------*/

#ifndef _RTCHAL_H_
#define _RTCHAL_H_
#include "HQS_typedef.h"
#include "stm32f10x.h"

/********************************************************
版权归作者所有 参考学习需联系作者授权 盗版必究
;函数名称：
;说    明： 
;使用资源：
;入    口：
;出    口：
;硬件接口:
;作    者：胡乔申 545044533@qq.com 13127766030
;时    间：2018.02.26
;修改注释：
;注意事项：
;版    本：V1.00
版权归作者所有   参考学习需联系作者授权    盗版必究
未经同意授权 造成作者损失 承担相关法律责任
Copyright (c) 2012-2099 HQS
*********************************************************/
void RTCHALIint(void);

void RTCHLSetCounter(uint32 count);

uint32  RTCHLGetCounter(void);




#endif



