/**
******************************************************************************
* @file
* @author  HQS 胡乔申
* @version V1.0.0
* @date    2018/03/01
* @brief   stm32f1 唯一ID
******************************************************************************
* @brief
*
*
*
*/
/* Includes ------------------------------------------------------------------*/

#ifndef _STM32IDHAL_H_
#define _STM32IDHAL_H_
#include "HQS_typedef.h"



/********************************************************
版权归作者所有 参考学习需联系作者授权 盗版必究
;函数名称：
;说    明： 
;使用资源：
;入    口：
;出    口：
;硬件接口:
;作    者：胡乔申 545044533@qq.com 13127766030
;时    间：2018.02.26
;修改注释：
;注意事项：
;版    本：V1.00
版权归作者所有   参考学习需联系作者授权    盗版必究
未经同意授权 造成作者损失 承担相关法律责任
Copyright (c) 2012-2099 HQS
*********************************************************/
static uint32 STM32ID[3];
void STM32GetIDCode(void)
{
	//获取CPU唯一ID
	CpuID[0] = *(vu32*)(0x1ffff7e8);
	CpuID[1] = *(vu32*)(0x1ffff7ec);
	CpuID[2] = *(vu32*)(0x1ffff7f0);
}




#endif



